{
    "intents":[
    {
       "tag": "admission_graduateprograms_admissionprocedure",
       "patterns": [
          "What are the necessary requirements for admission to the TUP Graduate Program?",
          "What are the necessary requirements for Graduate program?",
          "Give me the admission procedure for Graduate program?",
          "Guide for admission procedure for Graduate program?",
          "What are the steps for undergraduate program admission procedure",
          "Graduate Program admission procedure",
          "Requirements for Graduate program addmission procedure",
          "Where can one obtain the Application for Admission Form for the TUP Graduate Program?",
          "How long should the essay be for the Application for Admission Form?",
          "How many sealed recommendation letters are required for the application?",
          "What should the recommendation letters focus on?",
          "How many passport size pictures are required, and what background should they have?",
          "Is the Certificate of English proficiency required for all applicants?",
          "Where should the application requirements be submitted?",
          "Who is the contact person for inquiries about the TUP Graduate Program?",
          "What are the contact details for the Office of the Graduate Programs?",
          "What are the office hours for the Office of the Graduate Programs?",
          "What is the procedure for securing and accomplishing the TUP Graduate Program Admission Test (TUPGPAT) Application Form?",
          "Where can one pay for the TUPGPAT application fee?",
          "How much is the application fee for the Master's Program?",
          "How much is the application fee for the Doctoral Program?",
          "Where should one go after paying the application fee for scheduling the TUPGPAT?",
          "Who is the director of the Office of the Graduate Programs?",
          "What are the email and telephone contact details for inquiries about the TUP Graduate Program?",
          "What are the office hours for the Office of the Graduate Programs?",
          "Is there a specific day for the TUPGPAT examination, or is it scheduled individually?"
       ],
       "responses": [
          "Sure! Here's how to apply for the TUP Graduate Programs:\n\nADMISSION PROCEDURE\n1. Submit the following requirements in a long brown envelope. Only complete and accomplished requirements will be processed.\n• Accomplished Application for Admission Form (TUP Graduate Program)\nThe form can be downloaded at the TUP website\nAn essay of not less than 100 words stating the applicant's reason for applying in the program. (To be written/typewritten at the back of the Application for Admission Form)\nCertified True Copy of the Transcript of Records\n• Two (2) sealed recommendation letters The recommendation letter should describe the applicant's qualifications and potential for successfully completing graduate studies at TUP. It may also include comments and relevant insights such as on the applicant's character and outstanding skills/talents in line with the program applied for.\n• Three (3) passport size pictures with name tag on white background\n• Certificate of English proficiency as second language (for foreign student applicants only)\n• Application requirements should be submitted to the:\n\nDirector, Graduate Program \nTechnology University of the Philippines \nAyala Blvd., Ermita, Manila, 1000 Philippines \nTelephone No. (02)301-3001 loc. 704\n\n2. After passing the initial evaluation of application requirements, secure and accomplish the TUP Graduate Program Admission Test (TUPGPAT) Application Form at the Office of Graduate Program, 2/F CAP Building.\n3. Present the TUPGPAT Application Form to the cashier's office for payment.\nMaster's Program - P900.00\nDoctoral Program - P1,050.00\n4. Proceed to the Guidance Office, G/F CLA Building, and present the Official Receipt (O.R.) with the TUPGPAT Application Form for scheduling.\n5. On the scheduled date and time of examination indicated in the form, present the Official Receipt (O.R.) with the TUPGPAT Application Form to the administering officer/proctor at the Guidance Office, G/F CLA Building."
       ]
       },
       {
       "tag": "admission_procedure",
       "patterns": [
          "What are the necessary requirements for admission to the TUP Undergraduate Program?",
          "What are the necessary requirements for Undergraduate Program?",
          "Give me the academic procedure for Undergraduate program?",
          "Guide for enrollment procedure for Undergraduate program?",
          "What are the steps for undergraduate programs enrollment?",
          "Undergraduate enrollment procedure",
          "Requirements for Undergraduate programs enrollemnt",
          "Give me the enrollment procedure for undergraduate programs",
          "What is the first step in the admission procedure outlined in the document?",
          "What documents should applicants present at the Office of Admissions?",
          "How should applicants prepare their Pre-Registration Form for submission?",
          "What specific form is required from applicants?",
          "What type of birth certificate should applicants bring in admission?",
          "What are the specific medical documents required of the admission process?",
          "Where should applicants report after completing their medical/dental requirements?",
          "What documents are applicants expected to collect from the Office of Admissions?",
          "Who confirms the enrollment of applicants according to the admission procedure?",
          "What is the final step for applicants to secure their enrollment?",
          "What are the key responsibilities of applicants in the confirmation of enrollment process?",
          "Is the Pre-Registration Form required to be filled out digitally or by hand?",
          "Which document is required to prove completion of Grade 12 Senior High School (SHS)?",
          "Are female students required to provide additional documentation? If so, what is it?"
       ],
       "responses": [
          "Sure! Here are the Admission Procedure of Technological University of the Philippines-Manila:\n\nATTENTION:Before going into the admissions process, you must first set up an ERS (Electronic Registration System) account. By registering on the ERS platform, applicants can shorten their application process, resulting in better communication and document processing. This phase not only streamlines the application process, but also allows the institution to provide targeted support and guidance to potential students. Visit https://ers.tup.edu.ph/aims/applicants/ to set up your ERS account and begin the admissions process.\n\nPdf: https://drive.google.com/file/d/1lYm4BfKaB711UKwi7a41xuw9DYVXoPtR/view \n\nADMISSION PROCEDURE\nQUALIFIED APPLICANTS\nACADEMIC YEAR 2023-2024\nSTEP 1: REPORT TO OFFICE OF ADMISSIONS\nPRESENT THE FOLLOWING DOCUMENTS\na. Pre-Registration Form (Printed and Filled Out)\nb. Applicant Patient Record Form (Printed and Filled Out)\nc. Original & Photocopy of Grade 12 SHS Card\nd. Certificate of Good Moral Character\ne. PSA/NSO Birth Certificate (Original Photocopy) & PSA/NSO Marriage Certificate (Original & Photocopy for married only) female students only)\nSTEP 2: REPORT TO COLLEGE FOR INTERVIEW\nSTEP 3: REPORT TO MEDICAL/DENTAL CLINIC MEDICAL REQUIREMENTS (BRING ORIGINAL & PHOTOCOPY) TEC\nPRESENT THE FOLLOWING DOCUMENTS\na. Chest X-Ray (PA View)\n  • b. Drug Test\nSTEP 4: REPORT TO OFFICE OF ADMISSIONS\nREPORT BACK TO OFFICE OF ADMISSIONS FOR NOTICE OF ADMISSION, UNDERTAKING AND STUDENT PLEDGE\nSTEP 5: REPORT TO COLLEGE FOR ENLISTMENT\nSTEP 6: CONFIRMATION OF ENROLLMENT BY THE REGISTRAR"
       ]
       },
       {
        "tag": "admission_admission/enrollmentprocedure_foreign",
        "patterns": [
            "What are the necessary requirements for Foreign student applicant?",
            "Give me the academic procedure for Foreign student applicant?",
            "Guide for enrollment procedure for Foreign student applicant?",
            "What are the steps for foreign student applicant enrollment?",
            "Foreign enrollment procedure",
            "Requirements for Foreign Enrollement",
            "Give me the enrollment procedure for foreign student applicant",
            "What documents are required for evaluation by the respective college for undergraduate courses?",
            "Which documents should be submitted for evaluation for graduate-level courses?",
            "What is the next step after a successful evaluation of the submitted documents?",
            "What does a passing entrance test result in for the applicant?",
            "What is the applicant required to do after receiving notice of acceptance?",
            "What is the purpose of preparing necessary documents for a 9F Student Visa?",
            "Where should the applicant report after the issuance of a student visa?",
            "Which offices assist in the processing of the applicant's papers with the Department of Foreign Affairs and Bureau of Immigration and Deportation?",
            "Is there an option for arranging a tutorial for English courses for foreign students if needed?",
            "Who should foreign students report to regarding problems that may arise during their studies?",
            "What are the general admission requirements for foreign student applicants?",
            "Where should the Transcript of Records/Scholastic Records be authenticated for foreign student applicants?",
            "What financial documents are required for the Student Visa/Visa Conversion process?",
            "Who should provide the Notarized Affidavit of Support for foreign student applicants?",
            "What information should be included in the bank statements provided by the student applicant?",
            "Which page of the student's passport needs to be photocopied for the visa application process?",
            "What additional document should accompany the birth certificate for authentication?",
            "Are there any specific procedures mentioned for institutional scholars regarding financial documentation?",
            "Is there a specific contact point mentioned for any inquiries or assistance regarding the admission process for foreign students?"
        ],
          "responses": [
             "Sure! Here are the Admission Procedure of Technological University of the Philippines-Manila for Foreign students:\n\nFOREIGN STUDENTS\n 1. Foreign students wishing to study must submit the following documents for evaluation in the respective college:\n    • For undergraduate courses - high school records and diploma\n    • For graduate level - transcript of records and diploma in college\n2. After a successful evaluation, the applicant may take the entrance examination and pay the required application fee. A passing entrance test will earn the applicant a notice of acceptance.\n3. The applicant is then required to prepare the necessary documents for the issuance of a 9F Student Visa from the applicant's country of origin.\n4. Upon the issuance of a student visa, the applicant must report to the Office of Student Affairs (OSA) for assistance in the processing of the applicant's papers with the Department of Foreign Affairs and Bureau of Immigration and Deportation.\n5. If necessary, a tutorial for English course may be arranged for the applicant.\n6. Problems that may arise regarding the student's studies must be reported to the Foreign Student Adviser of the OSA.\n\nAdmission Requirements for Foreign Student Applicants\n1. Admission requirements for the program applied for\n2. To submit necessary documents for Student Visa/Visa Conversion:\n    • Transcript of Records/Scholastic Records duly authenticated by the Philippine Foreign Service Post located in the student applicant's country of origin or legal residence;\n    • A Notarized Affidavit of Support including bank statements, notarized notice of grant for institutional scholars to cover expenses for the student's accommodation and subsistence, as well as other school dues and other incidental expenses;\n    • Photocopy of data page of the student's passport showing date and place of birth, and birth certificate or its equivalent duly authenticated by the Philippine Foreign Service Post;\n    • Duly authenticated police clearance"
         ]        
        },
        {
        "tag": "admission_admission/enrollmentprocedure_freshmen",
        "patterns": [
            "What is the first step in the enrollment procedure for freshmen students?",
            "What documents are required to secure the Notice of Admission from the Office of Admissions?",
            "Are original transcripts necessary for transfer students during enrollment?",
            "Where should freshmen applicant go to obtain a Medical Certificate?",
            "What is the next step after obtaining the Notice of Admission and Medical Certificate?",
            "Who should freshmen applicant meet for course enlistment?",
            "What should freshmen applicant do if they are availing a scholarship during enrollment?",
            "Where can freshmen applicant get their scholarship notation?",
            "After assessment, where should students proceed to pay their fees?",
            "What documents should freshmen applicants present to the Registrar's Office for confirmation?",
            "Who handles the processing of Identification (ID) Cards for freshmen students?",
            "Is there a specific order in which these steps must be followed during freshmen enrollment?",
            "Are there any additional requirements for scholarship recipients during freshmen enrollment?",
            "What are the necessary requirements for Freshmen Enrollment?",
            "What are the enrollment procedure for Freshmen?",
            "What are the steps for freshmen enrollnment?",
            "Is there a guide for freshmen enrollment?",
            "Freshmen enrollment procedure",
            "Requirements for Freshmen Enrollemnt",
            "Give me the enrollment procedure for freshmen"
        ],
        "responses": [
            "Sure! Here are the Enrollment Procedure of Technological University of the Philippines-Manila for Freshmen students:\n\nENROLLMENT PROCEDURE FOR FRESHMEN STUDENTS\n1. Secure Notice of Admission from the Office of the Admissions upon presentation of the following documents:\n    • High School Card (Form 138) and Transcript of Records for transferees (Original)\n    • Certificate of Good Moral Character (Original)\n    • Test Permit\n2. Report to the University Clinic and secure Medical Certificate.\n3. With your Notice of Admission and Medical Certificate, proceed to the Office of Admissions for profiling.\n4. Proceed to your course adviser for enlistment.\n5. Students availing scholarship, report to the Office of Student Affairs for scholarship notation.\n6. Proceed to the Accounting Office for assessment and secure registration form.\n7. Pay the assessed fees at the Cashier's Office.\n8. With your Registration Form, present original requirements stated in Step #1 to the Registrar's Office for confirmation.\n9. Proceed to the Office of Student Affairs for Identification (ID) Card processing."
        ]
        },
        {
        "tag": "admission_admission/enrollmentprocedure_enrollment_oldstudents",
        "patterns": [
            "What is the first step for old students (second year to fifth year and graduate students) during enrollment?",
            "Is it necessary for old students to report to their course adviser for enlistment?",
            "What should old students do if they are availing a scholarship during enrollment?",
            "What should second year students do if they are availing a scholarship during enrollment?",
            "What should third year students do if they are availing a scholarship during enrollment?",
            "What should fourth year students do if they are availing a scholarship during enrollment?",
            "What should fifth year students do if they are availing a scholarship during enrollment?",
            "Where can old students get their scholarship notation?",
            "After assessment, where should old students proceed to pay their fees?",
            "What documents should oldstudents present for confirmation at the Registrar's Office?",
            "Who handles the processing of Identification (ID) Cards for old students?",
            "Is there a specific order in which these steps must be followed during enrollment for old students?",
            "Can old students proceed to pay fees before assessment at the accounting office?",
            "Are there any additional requirements for scholarship recipients during enrollment for old students?",
            "Is there a deadline for completing the enrollment procedure for old students?",
            "Are there any specific guidelines for the presentation of the Registration Form for old students?",
            "What services are offered by the Office of Student Affairs during the enrollment process for old students?",
            "Are there any changes in the enrollment procedure for old students compared to new students?",
            "What measures are in place to ensure the smooth processing of enrollment for old students?",
            "Is there any assistance provided to old students for navigating the enrollment process?",
            "What are the necessary requirements for old student Enrollment?",
            "What are the enrollment procedure for old student?",
            "What are the steps for old student?",
            "Is there a guide for old student",
            "Ols students enrollment procedure",
            "Requirements for old students enrollment",
            "Give me the enrollment procedure for old students"
        ],
        "responses": [
            "Sure! Here are the Enrollment Procedure of Technological University of the Philippines-Manila for old students(2nd year to 5th year):\n\nSECOND YEAR TO FIFTH YEAR AND GRADUATE STUDENTS (OLD STUDENTS)\n1. Proceed to your course adviser for enlistment.\n2. Students availing scholarship, report to the Office of Student Affairs for scholarship notation.\n3. Proceed to the accounting office for assessment and secure registration form.\n4. Pay the assessed fees at the Cashier's Office.\n5. Present your Registration Form to the Registrar's Office for confirmation.\n6. Proceed to the Office of Student Affairs for Identification (ID) Card processing"
        ]
        },
        {
        "tag": "admission_admission/enrollmentprocedure_enrollment_graduate",
        "patterns": [
            "What is the first step for graduate students in the enrollment process?",
            "What document should be presented to the Office of the Director for Graduate Programs to secure Admissions Evaluation?",
            "Where should students go for the entrance examination?",
            "After receiving the entrance exam results, where should students proceed for enlistment/enrollment?",
            "What should students do if they are availing a scholarship during enrollment?",
            "Where can students get their scholarship notation?",
            "After assessment, where should students proceed to pay their fees?",
            "Which office should students visit for confirmation of their Registration Form?",
            "Who handles the processing of Identification (ID) Cards for graduate students?",
            "Is there a specific order in which these steps must be followed during enrollment?",
            "Can students proceed to pay fees before assessment at the accounting office?",
            "Are there any additional requirements for scholarship recipients during enrollment?",
            "Are there any specific guidelines for the presentation of original requirements during confirmation?",
            "What services are offered by the Office of Student Affairs during the enrollment process",
            "What are the necessary requirements for graduate student Enrollment?",
            "What are the enrollment procedure for graduate student?",
            "What are the steps for graduate student?",
            "Is there a guide for graduate student",
            "Graduate program enrollment procedure",
            "Requirements for Graduate program enrollment",
            "Give me the enrollment procedure for graduate programs"
        ],
        "responses": [
            "Sure! Here are the Enrollment Procedure of Technological University of the Philippines-Manila for graduate programs/students:\n\nGRADUATE STUDENTS (NEW)\n1. Secure Admissions Evaluation from the Office of the Director for Graduate Programs upon presentation of your transcript of records.\n2. Proceed to the Guidance Office for entrance examination.\n3. With the entrance exam results, proceed to your respective course adviser for enlistment/enrollment.\n4. Students availing scholarship, report to the Office of Student Affairs for scholarship notation.\n5. Proceed to the accounting office for assessment and secure registration form.\n6. Pay the assessed fees at the Cashier's Office.\n7. With your Registration Form, present original requirements stated in Step #1 to the Registrar's Office for confirmation.\n8. Proceed to the Office of Student Affairs for Identification (ID) Card processing."
        ]
        },
        {
        "tag": "admission_admission/enrollmentprocedure_enrollment_scholars",
        "patterns": [
            "What is the first step for scholars in the enrollment process?",
            "What action should scholars take regarding their ERS grades?",
            "Where should scholars go to enlist their subjects based on their department/college?",
            "What is the procedure for handling billing and discounts for scholars?",
            "Where should scholars submit a photocopy of their Previous Rating Slip?",
            "Which office is responsible for assessing fees for scholars?",
            "After assessment, where should scholars go to confirm their registration?",
            "What documents should scholars present for confirmation at the Registrar's Office?",
            "Is there any specific action required after confirmation at the Registrar's Office?",
            "Are there any additional steps or requirements for specific scholarship programs such as 4P's Scholars or Iskolar ng Bayan?",
            "How does the enrollment process differ for scholars compared to non-scholar students?",
            "Can scholars proceed to pay fees before confirmation at the Registrar's Office?",
            "What assistance is provided to scholars during the enrollment process?",
            "Are there any changes in the enrollment procedure for scholars compared to previous years?",
            "Is there a designated point of contact for inquiries or assistance regarding the enrollment process for scholars?",
            "What are the necessary requirements for Scholar student Enrollment?",
            "What are the enrollment procedure for Scholar student?",
            "What are the enrollment procedure for 4P'S scholar student?",
            "What are the enrollment procedure for iskolar ng bayan scholar student?",
            "What are the enrollment procedure for CHED scholar student?",
            "What are the enrollment procedure for academic scholars student?",
            "What are the enrollment procedure for barangay grants scholar student?",
            "What are the enrollment procedure for kalinangan dance troupe scholar student?",
            "What are the enrollment procedure for charity first $ tsu chi scholar student?",
            "What are the enrollment procedure for TUP dependents cooperating teacher scholar student?",
            "What are the steps for scholar student enrollnment?",
            "Is there a guide for scholar student enrollment?",
            "Scholar students enrollment procedure",
            "Requirements for scholar student Enrollemnt",
            "Give me the enrollment procedure for scholar students"
        ],
        "responses": [
            "Sure! Here are the Enrollment Procedure of Technological University of the Philippines-Manila for Scholar students:\n\nALL 4P'S SCHOLARS, ISKOLAR NG BAYAN, CHED SCHOLARS, ACADEMIC SCHOLARS, BARANGAY GRANTS, KALINANGAN DANCE TROUPE, CHARITY FIRST $ TSU CHI, TUP DEPENDENTS COOPERATING TEACHER\n\n1. Print your ERS grades.\n2. Enlist subjects (Department/College)\n3. Billing/Discount - OSA (Submit photocopy of Previous Rating Slip)\n4. Accounting - for Assessment\n5. Present your Registration Form to the Registrar's Office for confirmation.\n6. Go back to OSA for the submission of Registration Form (photocopy)"
        ]
        },
        {
        "tag": "admission_graduateprograms_contacts",
        "patterns": [
            "What is the email address for contacting the Graduate Program at TUP?",
            "How can I reach the Graduate Program office at TUP via telephone?",
            "What are the office hours for the Graduate Program at TUP?",
            "When is the Graduate Program office closed during the week?",
            "Can you provide the email address for inquiries regarding graduate studies at TUP?",
            "What is the telephone number for contacting the Graduate Program office at TUP?",
            "What are the operating hours of the Graduate Program office at TUP?",
            "How can I contact the Graduate Program office outside of its regular office hours?",
            "Do you have the contact details for the Graduate Program office at TUP?",
            "Could you please provide the email and telephone contacts for the Graduate Program office at TUP?",
            "Could you please provide contacts details for the Graduate Program office at TUP?",
            "Give the contacts details for the Graduate Program office at TUP?",
            "What is the contacts details for the Graduate Program office at TUP?",
            "What is the contacts details for the Graduate Program office at TUP for College of Industrial Education",
            "What is the contacts details for the Graduate Program office at TUP for College of Industrial Technology",
            "What is the contacts details for the Graduate Program office at TUP for College of Science",
            "What is the contacts details for the Graduate Program office at TUP for College of Liberal Arts",
            "What is the contacts details for the Graduate Program office at TUP for College of Architecture and Fine Arts",
            "What is the contacts details for the Graduate Program office at TUP for College of Engineering"
        ],
        "responses": [
            "Sure! Here's the Contact details of Graduate program office of Technological University of the Philippines-Manila:\n\nCONTACTS\n\nE-mail\ngraduate@tup.edu.ph\n\nTelephone No.\n5301.3040/5301.3041\n\nOffice Hours\n8:00am - 5:00pm | Monday- Friday"
        ]
        },
        {
        "tag": "admission_graduateprograms_officeofgraduateprograms",
        "patterns": [
            "Who is the Director of the Office of the Graduate Programs?",
            "What is the name of the individual serving as the Director of the Graduate Programs Office?",
            "Who holds the position of Director in the Office of the Graduate Programs?",
            "Who is the current Director of the Graduate Programs at TUP?",
            "What is the name of the Director of the Graduate Programs department?",
            "Who is responsible for overseeing the Graduate Programs at TUP?",
            "Can you tell me the name of the person serving as the Director of the Office of Graduate Programs?",
            "What is the title and name of the individual leading the Graduate Programs Office?",
            "Who is the Director of the Graduate Programs department at TUP?",
            "Who is the Director of the Graduate Programs for College of Industrial Education",
            "Who is the Director of the Graduate Programs for College of Industrial Technology",
            "Who is the Director of the Graduate Programs for College of Science",
            "Who is the Director of the Graduate Programs for College of Liberal Arts",
            "Who is the Director of the Graduate Programs for College of Architecture and Fine Arts",
            "Who is the Director of the Graduate Programs for College of Engineering"
        ],
        "responses": [
            "Sure! Here's the Director of Graduate program of Technological University of the Philippines-Manila:\n\nOFFICE OF THE GRADUATE PROGRAMS\nDr. Melbern Rose Maltezo, Director, Office of the Graduate Program"
        ]
        },
        {
        "tag": "admission_graduateprograms_programsoffering_collegeofindustrialeducation",
        "patterns": [
            "What doctoral programs does the College of Industrial Education offer?",
            "Can you list the doctoral degrees available in the College of Industrial Education?",
            "What are the options for Doctor of Education majors in the College of Industrial Education?",
            "Could you provide the list of doctoral programs with a focus on technology in the College of Industrial Education?",
            "What is the Doctor of Technology program offered by the College of Industrial Education?",
            "Which program focuses on Technology Management at the doctoral level in the College of Industrial Education?",
            "Can you name the master's programs available in the College of Industrial Education?",
            "What are the Master of Arts programs offered by the College of Industrial Education?",
            "Could you list the Master of Arts programs focusing on Industrial Education in the College of Industrial Education?",
            "What are the majors available under the Master of Arts in Industrial Education program?",
            "Which master's program in the College of Industrial Education emphasizes Curriculum and Instruction?",
            "What options are there for Master of Arts programs focusing on Educational Technology?",
            "Can you provide the list of Master of Arts programs focusing on Administration and Supervision?",
            "What master's program focuses on Guidance and Counseling in the College of Industrial Education?",
            "What program is offered under the Master of Arts in Teaching major in Technology and Home Economics?",
            "Could you list the master's programs that focus on Technology Education?",
            "What are the available options for master's programs in the College of Industrial Education?",
            "Which programs in the College of Industrial Education are designed for masteral?",
            "Can you provide details about the graduate programs available for masteral in the College of Industrial Education?",
            "What specialization areas are covered in the graduate programs offered by the College of Industrial Education?"
        ],
        "responses": [
            "Sure! Here's the List of Graduate programs that Technological University of the Philippines-Manila offers under of College of Industrial Education:\n\nGRADUATE PROGRAMS OFFERED BY COLLEGE OF INDUSTRIAL EDUCATION\n+ Doctor of Education major in Industrial Education Management\n+ Doctor of Education major in Career Guidance\n+ Doctor of Technology\n+ Doctor of Philosophy major in Technology Management\n+ Master of Arts in Industrial Education major in Curriculum and Instruction\n+ Master of Arts in Industrial Education major in Educational Technology\n+ Master of Arts in Industrial Education major in Administration and Supervision\n+ Master of Arts in Industrial Education major in Guidance and Counseling\n+ Master of Arts in Teaching major in Technology and Home Economics\n+ Master of Technology Education"
        ]
        },
        {
        "tag": "admission_graduateprograms_programsoffering_collegeofindustrialtechnology",
        "patterns": [
            "What masteral programs does the College of Industrial Technology offer?",
            "Can you list the Master degrees available in the College of Industrial Technology?",
            "What are the options for Masteral in the College of Industrial Technology?",
            "Could you provide the list of masteral programs in the College of Industrial Technology?",
            "What is the Masteral program offered by the College of Industrial Technology?",
            "Can you name the master's programs available in the College of Industrial Technology?",
            "What are the Masteral programs offered by the College of Industrial Technology?",
            "Could you list the Masteral programs in the College of Industrial Technology?",
            "What are the available options for master's programs in the College of Industrial Technology?",
            "Which programs in the College of Industrial Technology are designed for masteral?",
            "Can you provide the graduate programs available for masteral in the College of Industrial Technology?",
            "What specialization areas are covered in the graduate programs offered by the College of Industrial Technology?"
        ],
        "responses": [
            "Sure! Here's the List of Graduate programs that Technological University of the Philippines-Manila offers under of College of Industrial Technology:\n\nGRADUATE PROGRAMS OFFERED BY COLLEGE OF INDUSTRIAL TECHNOLOGY\n\n+ Master of Technology"
        ]
        },
        {
        "tag": "admission_graduateprograms_programsoffering_collegeofscience",
        "patterns": [
            "What graduate programs does the College of Science offer?",
            "Can you list the master's programs available in the College of Science?",
            "What are the options for Master of Arts in Teaching majors in the College of Science? ",
            "Could you provide the list of Master of Arts programs focusing on specific subjects in the College of Science?",
            "What is the Master of Information Technology program offered by the College of Science?",
            "Which program focuses on Physics education at the master's level in the College of Science?",
            "Can you name the master's programs available for Mathematics educators in the College of Science?",
            "What are the majors available under the Master of Arts in Teaching program in the College of Science?",
            "Which master's program in the College of Science emphasizes General Science education?",
            "What options are there for Master of Arts programs focusing on Chemistry in the College of Science?",
            "Could you list the Master of Arts in Teaching programs focusing on specific science subjects?",
            "What are the available options for master's programs in the College of Science?",
            "Could you list the Masteral programs in the College of Science?",
            "Which programs in the College of Science are designed for masteral?",
            "What are the Masteral programs offered by the College of Science?",
            "Can you name the master's programs available in the College of Industrial Technology?",
            "What masteral programs does the College of Science offer?",
            "Could you provide the list of masteral programs in the College of Science?"
        ],
        "responses": [
            "Sure! Here's the List of Graduate programs that Technological University of the Philippines-Manila offers under of College of Science:\n\nGRADUATE PROGRAMS OFFERED BY COLLEGE OF SCIENCE\n\n+ Master of Arts in Teaching major in Physics\n+ Master of Arts in Teaching major in Mathematics\n+ Master of Arts in Teaching major in General Science\n+ Master of Arts in Teaching major in Chemistry\n+ Master of Information Technology"
        ]
        },
        {
        "tag": "admission_graduateprograms_programsoffering_collegeofliberalarts",
        "patterns": [
            "What masteral programs does the College of Liberal Arts offer?",
            "Can you list the Master degrees available in the College of Liberal Arts?",
            "What are the options for Masteral in the College of Liberal Arts?",
            "Could you provide the list of masteral programs in the College of Liberal Arts?",
            "What is the Masteral program offered by the College of Liberal Arts?",
            "Can you name the master's programs available in the College of Liberal Arts?",
            "What are the Masteral programs offered by the College of Liberal Arts?",
            "Could you list the Masteral programs in the College of Liberal Arts?",
            "What are the available options for master's programs in the College of Liberal Arts?",
            "Which programs in the College of Liberal Arts are designed for masteral?",
            "Can you provide the graduate programs available for masteral in the College of Liberal Arts?",
            "What specialization areas are covered in the graduate programs offered by the College of Liberal Arts?",
            "What doctoral programs does the College of Liberal Arts offer?",
            "Can you list the doctoral degrees available in the College of Liberal Arts?"
        ],
        "responses": [
            "Sure! Here's the List of Graduate programs that Technological University of the Philippines-Manila offers under of College of Liberal Arts:\n\nGRADUATE PROGRAMS OFFERED BY COLLEGE OF LIBERAL ARTS\n\n+ Doctor of Management Science\n+ Master in Management"
        ]
        },
        {
        "tag": "admission_graduateprograms_programsoffering_collegeofarchitectureandfinearts",
        "patterns": [
            "What masteral programs does the College of Architecture and Fine Arts offer?",
            "Can you list the Master degrees available in the College of Architecture and Fine Arts?",
            "What are the options for Masteral in the College of Architecture and Fine Arts?",
            "Could you provide the list of masteral programs in the College of Architecture and Fine Arts?",
            "What is the Masteral program offered by the College of Architecture and Fine Arts?",
            "Can you name the master's programs available in the College of Architecture and Fine Arts?",
            "What are the Masteral programs offered by the College of Architecture and Fine Arts?",
            "Could you list the Masteral programs in the College of Architecture and Fine Arts?",
            "What are the available options for master's programs in the College of Architecture and Fine Arts?",
            "Which programs in the College of Architecture and Fine Arts are designed for masteral?",
            "Can you provide the graduate programs available for masteral in the College of Architecture and Fine Arts?",
            "What specialization areas are covered in the graduate programs offered by the College of Architecture and Fine Arts?"
        ],
        "responses": [
            "Sure! Here's the List of Graduate programs that Technological University of the Philippines-Manila offers under of College of Architecture and Fine Arts:\n\nGRADUATE PROGRAMS OFFERED BY COLLEGE OF ARCHITECTURE AND FINE ARTS\n\n+ Master in Architecture major in Construction Technology Management\n+ Master in Graphics Technology"
        ]
        },
        {
        "tag": "admission_graduateprograms_programsoffering_collegeofengineering",
        "patterns": [
            "What masteral programs does the College of Engineering offer?",
            "Can you list the Master degrees available in the College of Engineering?",
            "What are the options for Masteral in the College of Engineering?",
            "Could you provide the list of masteral programs in the College of Engineering?",
            "What is the Masteral program offered by the College of Engineering?",
            "Can you name the master's programs available in the College of Engineering?",
            "What are the Masteral programs offered by the College of Engineering?",
            "Could you list the Masteral programs in the College of Engineering?",
            "What are the available options for master's programs in the College of Engineering?",
            "Which programs in the College of Engineering are designed for masteral?",
            "Can you provide the graduate programs available for masteral in the College of Engineering?",
            "What are the majors available under the Master of Science in Electrical Engineering program?",
            "What specialization areas are covered in the graduate programs offered by the College of Engineering?"
        ],
        "responses": [
            "Sure! Here's the List of Graduate programs that Technological University of the Philippines-Manila offers under of College of Engineering:\n\nGRADUATE PROGRAMS OFFERED BY COLLEGE OF ENGINEERING\n\n+ Master of Engineering Program\n+ Master of Science in Civil Engineering major in General Civil Engineering\n+ Master of Science in Civil Engineering major in Geotechnical Engineering\n+ Master of Science in Civil Engineering major in Structural Engineering\n+ Master of Science in Electrical Engineering major in Power System Engineering\n+ Master of Science in Electrical Engineering major in Instrumentation and Control Engineering\n+ Master of Science in Electrical Engineering major in Electronics Engineering\n+ Master of Science in Electrical Engineering major in Communications Engineering\n+ Master of Science in Electrical Engineering\n+ Master of Science in Electrical Engineering major in Computer Engineering\n+ Master of Science in Mechanical Engineering major in Energy Engineering\n+ Master of Science in Mechanical Engineering major in Production Technology\n+ Masters of Engineering Program in Civil Engineering major in Structural Engineering Option\n+ Masters of Engineering Program in Civil Engineering major in Geotechnical Engineering Option\n+ Masters of Engineering Program in Civil Engineering major in General Civil Engineering Option\n+ Masters of Engineering Program in Electrical Engineering major in Power Engineering Option\n+ Masters of Engineering Program in Electrical Engineering major in Instrumentation and Computer Engineering Option\n+ Masters of Engineering Program in Electrical Engineering major in Electronics and Communications Engineering Option\n+ Masters of Engineering Program in Mechanical Engineering major in Refrigeration and Airconditioning Option\n+ Masters of Engineering Program in Mechanical Engineering major in Heat Power Option\n+ Masters of Engineering Program in Mechanical Engineering major in Manufacturing and Production Opti"
        ]
        },
        {
        "tag": "admission_graduateprograms_programsoffering",
        "patterns": [
            "What masteral programs does the TUP offer?",
            "Can you list the Master degrees available in  TUP?",
            "What are the options for Masteral in TUP?",
            "Could you provide the list of masteral programs in TUP?",
            "What is the Masteral program offered by TUP?",
            "Can you name the master's programs available in TUP?",
            "What are the Masteral programs offered by TUP?",
            "Could you list the Masteral programs in TUP?",
            "What are the available options for master's programs in TUP?",
            "Which programs in TUP are designed for masteral?",
            "Can you provide the graduate programs available for masteral in TUP?",
            "What specialization areas are covered in the graduate programs offered by TUP?",
            "What doctoral programs does the TUP offer?",
            "Can you list the doctoral degrees available in TUP?",
            "What graduate programs does the TUP offer?",
            "Can you list the graduate programs available in  TUP?",
            "Could you provide the list of graduate programs in TUP?",
            "What is the graduate programs offered by TUP?",
            "Can you name the graduate programs available in TUP?",
            "What are the graduate programs offered by TUP?",
            "What are the available options for graduate programs in TUP?"
        ],
        "responses": [
            "Sure! Here's the List of Graduate programs that Technological University of the Philippines-Manila offers:\n\nGRADUATE PROGRAMS OFFERED BY TUP\n\nCOLLEGE OF INDUSTRIAL EDUCATION\n+ Doctor of Education major in Industrial Education Management\n+ Doctor of Education major in Career Guidance\n+ Doctor of Technology\n+ Doctor of Philosophy major in Technology Management\n+ Master of Arts in Industrial Education major in Curriculum and Instruction\n+ Master of Arts in Industrial Education major in Educational Technology\n+ Master of Arts in Industrial Education major in Administration and Supervision\n+ Master of Arts in Industrial Education major in Guidance and Counseling\n+ Master of Arts in Teaching major in Technology and Home Economics\n+ Master of Technology Education\n\nCOLLEGE OF INDUSTIAL TECHNOLOGY\n+ Master of Technology\n\nCOLLEGE OF SCIENCE\n+ Master of Arts in Teaching major in Physics\n+ Master of Arts in Teaching major in Mathematics\n+ Master of Arts in Teaching major in General Science\n+ Master of Arts in Teaching major in Chemistry\n+ Master of Information Technology\n\nCOLLEGE OF LIBERAL ARTS\n+ Doctor of Management Science\n+ Master in Management\n\nCOLLEGE OF ARCHITECTURE AND FINE ARTS\n+ Master in Architecture major in Construction Technology Management\n+ Master in Graphics Technology\n\nCOLLEGE OF ENGINEERING\n+ Master of Engineering Program\n+ Master of Science in Civil Engineering major in General Civil Engineering\n+ Master of Science in Civil Engineering major in Geotechnical Engineering\n+ Master of Science in Civil Engineering major in Structural Engineering\n+ Master of Science in Electrical Engineering major in Power System Engineering\n+ Master of Science in Electrical Engineering major in Instrumentation and Control Engineering\n+ Master of Science in Electrical Engineering major in Electronics Engineering\n+ Master of Science in Electrical Engineering major in Communications Engineering\n+ Master of Science in Electrical Engineering\n+ Master of Science in Electrical Engineering major in Computer Engineering\n+ Master of Science in Mechanical Engineering major in Energy Engineering\n+ Master of Science in Mechanical Engineering major in Production Technology\n+ Masters of Engineering Program in Civil Engineering major in Structural Engineering Option\n+ Masters of Engineering Program in Civil Engineering major in Geotechnical Engineering Option\n+ Masters of Engineering Program in Civil Engineering major in General Civil Engineering Option\n+ Masters of Engineering Program in Electrical Engineering major in Power Engineering Option\n+ Masters of Engineering Program in Electrical Engineering major in Instrumentation and Computer Engineering Option\n+ Masters of Engineering Program in Electrical Engineering major in Electronics and Communications Engineering Option\n+ Masters of Engineering Program in Mechanical Engineering major in Refrigeration and Airconditioning Option\n+ Masters of Engineering Program in Mechanical Engineering major in Heat Power Option\n+ Masters of Engineering Program in Mechanical Engineering major in Manufacturing and Production Option"
        ]
        }
 ]
 }